<html>
<head>
    <meta charset="utf-8">
    <title>在线机器人统计</title>
    <link rel="stylesheet" type="text/css" href="easyUI/themes/default/easyui.css">
    <link rel="stylesheet" type="text/css" href="easyUI/themes/icon.css">
    <link rel="stylesheet" href="css/statics.css" type="text/css">
    <script type="text/javascript" src="easyUI/jquery.min.js"></script>
    <script type="text/javascript" src="easyUI/jquery.easyui.min.js"></script>
    <script src="echarts.min.js"></script>
    <script src="china.js"></script>
    <script src="world.js"></script>
</head>
<?php
if (isset($_GET['map']) == false)
    $_GET['map'] = 'china';
else if ($_GET['map'] != 'china' && $_GET['map'] != 'world')
{
    echo '<script type="text/javascript">alert("param error");</script>';
    die();
}
?>
<style>
    .head_bar{
        font-size:12px;
        display: flex;
    }
    .selectType{
        margin-left: 20px;
    }
</style>
<body onresize="g_oChart.resize();">
<div class="head_bar" id="head_bar">
    在线机器人数/总机器人数:<?php
    chdir(dirname(__FILE__));
    include_once('./config.php');
    $g_poDBConfig = CSys_Conf::$DB_Config;

    $g_oDBConn = @new mysqli('p:'.$g_poDBConfig['server'],$g_poDBConfig['user'],$g_poDBConfig['psw'],$g_poDBConfig['database']);
    $g_oDBConn->set_charset('utf8');
    $xResult = $g_oDBConn->query('SELECT COUNT(1) `UTotal` FROM `RUserBase` WHERE isOnline=1');
    if ($xResult === FALSE)
        echo 'Nan/';
    else
    {
        $oRow = $xResult->fetch_array();
        echo $oRow['UTotal'].'/';
    }
    $xResult = $g_oDBConn->query('SELECT COUNT(1) `UTotal` FROM `RUserBase`');
    if ($xResult === FALSE)
        echo 'Nan';
    else
    {
        $oRow = $xResult->fetch_array();
        echo $oRow['UTotal'];
    }
    ?>&nbsp;
    <div class="selectType">
        <label style="">选择机器人：</label>
        <select class=""  style="width:150px;" name="selectType" id="selectType" onchange="AnsyRefresh(this.value)">
            <option value="0">所有机器人</option>
            <option value="1">在线机器人</option>
        </select>
    </div>
    <a class="refreshData l-btn l-btn-small" onclick="refresh()">刷新</a>
</div>
<hr>
<div id="main" style="width:100%;height:100%;">
</div>
<script type="text/javascript">
    /*
     * 显示等待界面
     * @param require string strMsg,界面要显示的信息
     * @param optional bool bAddCount = false,是否同时增加隐藏次数，用于在调用HideFullMask时确认是否真正需要隐藏屏蔽层
     * @return void
     */
    function SetFullMask(strMsg,bAddCount)
    {
        if (typeof(m_oFullMaskTip) == "undefined")
        {
            m_oFullMaskTip = new function()
            {
                var m_oMask	= $('<div class="window-mask" style="z-index:99999"></div>').appendTo('body');
                var m_oTip	= $('<div id="full_mask" class="datagrid-mask-msg panel-body" style="left:49%;top:49%;z-index:99999;white-spacing:nowrap;overflow:hidden;height:auto;"></div>').appendTo('body');
                var m_astrStack = [];

                this.Show = function(strMsg,bAddCount)
                {
                    if (bAddCount == true)
                        m_astrStack.push(strMsg);
                    m_oMask.css
                    ({
                        width	:	'100%',
                        height	:	$(document).height()
                    });
                    m_oMask.show();
                    m_oTip.html(strMsg).show();
                }

                this.Hide = function(bSubCount,bForceClose)
                {
                    var strLastTip = '';
                    if (m_astrStack.length > 0)
                    {
                        if (bSubCount == true)
                            strLastTip = m_astrStack.pop();
                        strLastTip = m_astrStack[m_astrStack.length - 1];
                    }
                    if (m_astrStack.length == 0 || bForceClose == true)
                    {
                        m_oMask.hide();
                        m_oTip.hide();
                        m_astrStack = [];
                    }
                    else
                        m_oTip.html(strLastTip);
                }

                this.SetText = function(strMsg)
                {
                    if (strMsg == undefined)
                        strMsg = ''
//				console.log(strMsg);
                    m_oTip.html(strMsg);
                }
            };
        }
        m_oFullMaskTip.Show(strMsg,bAddCount);
    };

    /*
     * 隐藏显示等待界面
     * @param optional bool bSubCount = false,是否同时减少隐藏次数的操作，用于确认是否真正需要隐藏屏蔽层
     * @param optional bool bForceClose = false,是否强制关闭屏蔽层,默认[否]
     * @return void
     */
    function HideFullMask(bSubCount,bForceClose)
    {
        if (typeof(m_oFullMaskTip) != "undefined")
            m_oFullMaskTip.Hide(bSubCount,bForceClose);
    };

    var g_oChart = null;
    function ShowChart(poDom,oData)
    {
        if (g_oChart == null)
        {
            g_oChart = echarts.init(poDom);
            g_oChart.setOption
            ({
                backgroundColor: '#404a59',
                title:
                    {
                        text	:	'在线机器人统计',
                        left	:	'center',
                        textStyle:	{color: '#fff'}
                    },
                geo:
                    {
                        map		:	<?php echo '"'.$_GET['map'].'"'?>,
                        label	:
                            {
                                emphasis:{show: false}
                            },
                        roam	:	true,
                        itemStyle:
                            {
                                normal:
                                    {
                                        areaColor	:	'#323c48',
                                        borderColor	:	'#111'
                                    },
                                emphasis	:	{areaColor:'#2a333d'}
                            }
                    },
                tooltip:
                    {
                        trigger	:	'item',
                        formatter:	function(oParam){return oParam.name + ' - ' + oParam.value[2]},
                    },
            });
        }
        //坐标数据
        var mapGeoCoordMap = {
            '海门':[121.15,31.89],
            '鄂尔多斯':[109.781327,39.608266],
            '招远':[120.38,37.35],
            '舟山':[122.207216,29.985295],
            '齐齐哈尔':[123.97,47.33],
            '盐城':[120.13,33.38],
            '赤峰':[118.87,42.28],
            '青岛':[120.33,36.07],
            '乳山':[121.52,36.89],
            '金昌':[102.188043,38.520089],
            '泉州':[118.58,24.93],
            '莱西':[120.53,36.86],
            '日照':[119.46,35.42],
            '胶南':[119.97,35.88],
            '南通':[121.05,32.08],
            '拉萨':[91.11,29.97],
            '云浮':[112.02,22.93],
            '梅州':[116.1,24.55],
            '文登':[122.05,37.2],
            '上海':[121.48,31.22],
            '攀枝花':[101.718637,26.582347],
            '威海':[122.1,37.5],
            '承德':[117.93,40.97],
            '厦门':[118.1,24.46],
            '汕尾':[115.375279,22.786211],
            '潮州':[116.63,23.68],
            '丹东':[124.37,40.13],
            '太仓':[121.1,31.45],
            '曲靖':[103.79,25.51],
            '烟台':[121.39,37.52],
            '福州':[119.3,26.08],
            '瓦房店':[121.979603,39.627114],
            '即墨':[120.45,36.38],
            '抚顺':[123.97,41.97],
            '玉溪':[102.52,24.35],
            '张家口':[114.87,40.82],
            '阳泉':[113.57,37.85],
            '莱州':[119.942327,37.177017],
            '湖州':[120.1,30.86],
            '汕头':[116.69,23.39],
            '昆山':[120.95,31.39],
            '宁波':[121.56,29.86],
            '湛江':[110.359377,21.270708],
            '揭阳':[116.35,23.55],
            '荣成':[122.41,37.16],
            '连云港':[119.16,34.59],
            '葫芦岛':[120.836932,40.711052],
            '常熟':[120.74,31.64],
            '东莞':[113.75,23.04],
            '河源':[114.68,23.73],
            '淮安':[119.15,33.5],
            '泰州':[119.9,32.49],
            '南宁':[108.33,22.84],
            '营口':[122.18,40.65],
            '惠州':[114.4,23.09],
            '江阴':[120.26,31.91],
            '蓬莱':[120.75,37.8],
            '韶关':[113.62,24.84],
            '嘉峪关':[98.289152,39.77313],
            '广州':[113.23,23.16],
            '延安':[109.47,36.6],
            '太原':[112.53,37.87],
            '清远':[113.01,23.7],
            '中山':[113.38,22.52],
            '昆明':[102.73,25.04],
            '寿光':[118.73,36.86],
            '盘锦':[122.070714,41.119997],
            '长治':[113.08,36.18],
            '深圳':[114.07,22.62],
            '珠海':[113.52,22.3],
            '宿迁':[118.3,33.96],
            '咸阳':[108.72,34.36],
            '铜川':[109.11,35.09],
            '平度':[119.97,36.77],
            '佛山':[113.11,23.05],
            '海口':[110.35,20.02],
            '江门':[113.06,22.61],
            '章丘':[117.53,36.72],
            '肇庆':[112.44,23.05],
            '大连':[121.62,38.92],
            '临汾':[111.5,36.08],
            '吴江':[120.63,31.16],
            '石嘴山':[106.39,39.04],
            '沈阳':[123.38,41.8],
            '苏州':[120.62,31.32],
            '茂名':[110.88,21.68],
            '嘉兴':[120.76,30.77],
            '长春':[125.35,43.88],
            '胶州':[120.03336,36.264622],
            '银川':[106.27,38.47],
            '张家港':[120.555821,31.875428],
            '三门峡':[111.19,34.76],
            '锦州':[121.15,41.13],
            '南昌':[115.89,28.68],
            '柳州':[109.4,24.33],
            '三亚':[109.511909,18.252847],
            '自贡':[104.778442,29.33903],
            '吉林':[126.57,43.87],
            '阳江':[111.95,21.85],
            '泸州':[105.39,28.91],
            '西宁':[101.74,36.56],
            '宜宾':[104.56,29.77],
            '呼和浩特':[111.65,40.82],
            '成都':[104.06,30.67],
            '大同':[113.3,40.12],
            '镇江':[119.44,32.2],
            '桂林':[110.28,25.29],
            '张家界':[110.479191,29.117096],
            '宜兴':[119.82,31.36],
            '北海':[109.12,21.49],
            '西安':[108.95,34.27],
            '金坛':[119.56,31.74],
            '东营':[118.49,37.46],
            '牡丹江':[129.58,44.6],
            '遵义':[106.9,27.7],
            '绍兴':[120.58,30.01],
            '扬州':[119.42,32.39],
            '常州':[119.95,31.79],
            '潍坊':[119.1,36.62],
            '重庆':[106.54,29.59],
            '台州':[121.420757,28.656386],
            '南京':[118.78,32.04],
            '滨州':[118.03,37.36],
            '贵阳':[106.71,26.57],
            '无锡':[120.29,31.59],
            '本溪':[123.73,41.3],
            '克拉玛依':[84.77,45.59],
            '渭南':[109.5,34.52],
            '马鞍山':[118.48,31.56],
            '宝鸡':[107.15,34.38],
            '焦作':[113.21,35.24],
            '句容':[119.16,31.95],
            '北京':[116.46,39.92],
            '徐州':[117.2,34.26],
            '衡水':[115.72,37.72],
            '包头':[110,40.58],
            '绵阳':[104.73,31.48],
            '乌鲁木齐':[87.68,43.77],
            '枣庄':[117.57,34.86],
            '杭州':[120.19,30.26],
            '淄博':[118.05,36.78],
            '鞍山':[122.85,41.12],
            '溧阳':[119.48,31.43],
            '库尔勒':[86.06,41.68],
            '安阳':[114.35,36.1],
            '开封':[114.35,34.79],
            '济南':[117,36.65],
            '德阳':[104.37,31.13],
            '温州':[120.65,28.01],
            '九江':[115.97,29.71],
            '邯郸':[114.47,36.6],
            '临安':[119.72,30.23],
            '兰州':[103.73,36.03],
            '沧州':[116.83,38.33],
            '临沂':[118.35,35.05],
            '南充':[106.110698,30.837793],
            '天津':[117.2,39.13],
            '富阳':[119.95,30.07],
            '泰安':[117.13,36.18],
            '诸暨':[120.23,29.71],
            '郑州':[113.65,34.76],
            '哈尔滨':[126.63,45.75],
            '聊城':[115.97,36.45],
            '芜湖':[118.38,31.33],
            '唐山':[118.02,39.63],
            '平顶山':[113.29,33.75],
            '邢台':[114.48,37.05],
            '德州':[116.29,37.45],
            '济宁':[116.59,35.38],
            '荆州':[112.239741,30.335165],
            '宜昌':[111.3,30.7],
            '义乌':[120.06,29.32],
            '丽水':[119.92,28.45],
            '洛阳':[112.44,34.7],
            '秦皇岛':[119.57,39.95],
            '株洲':[113.16,27.83],
            '石家庄':[114.48,38.03],
            '莱芜':[117.67,36.19],
            '常德':[111.69,29.05],
            '保定':[115.48,38.85],
            '湘潭':[112.91,27.87],
            '金华':[119.64,29.12],
            '岳阳':[113.09,29.37],
            '长沙':[113,28.21],
            '衢州':[118.88,28.97],
            '廊坊':[116.7,39.53],
            '菏泽':[115.480656,35.23375],
            '合肥':[117.27,31.86],
            '武汉':[114.31,30.52],
            '大庆':[125.03,46.58],
            ///////world//////////
            "阿富汗":[69.11,34.28],
            "阿尔巴尼亚":[19.49,41.18],
            "阿尔及利亚":[3.08,36.42],
            "美属萨摩亚":[-170.43,-14.16],
            "安道​​尔":[1.32,42.31],
            "安哥拉":[13.15,-8.50],
            "安提瓜和巴布达":[-61.48,17.20],
            "阿根廷":[-60.00,-36.30],
            "亚美尼亚":[44.31,40.10],
            "阿鲁巴":[-70.02,12.32],
            "澳大利亚":[149.08,-35.15],
            "奥地利":[16.22,48.12],
            "阿塞拜疆":[49.56,40.29],
            "巴哈马":[-77.20,25.05],
            "巴林":[50.30,26.10],
            "孟加拉国":[90.26,23.43],
            "巴巴多斯":[-59.30,13.05],
            "白俄罗斯":[27.30,53.52],
            "比利时":[4.21,50.51],
            "伯利兹":[-88.30,17.18],
            "贝宁":[2.42,6.23],
            "不丹":[89.45,27.31],
            "玻利维亚":[-68.10,-16.20],
            "波斯尼亚和黑塞哥维那":[18.26,43.52],
            "博茨瓦纳":[25.57,-24.45],
            "巴西":[-47.55,-15.47],
            "英属维尔京群岛":[-64.37,18.27],
            "文莱":[115.00,4.52],
            "保加利亚":[23.20,42.45],
            "布基纳法索":[-1.30,12.15],
            "布隆迪":[29.18,-3.16],
            "柬埔寨":[104.55,11.33],
            "喀麦隆":[11.35,3.50],
            "加拿大":[-75.42,45.27],
            "佛得角":[-23.34,15.02],
            "开曼群岛":[-81.24,19.20],
            "中非共和国":[18.35,4.23],
            "乍得":[14.59,12.10],
            "智利":[-70.40,-33.24],
            "中国":[116.20,39.55],
            "哥伦比亚":[-74.00,4.34],
            "科摩罗":[43.16,-11.40],
            "刚果":[15.12,-4.09],
            "哥斯达黎加":[-84.02,9.55],
            "科特迪瓦":[-5.17,6.49],
            "克罗地亚":[15.58,45.50],
            "古巴":[-82.22,23.08],
            "塞浦路斯":[33.25,35.10],
            "捷克共和国":[14.22,50.05],
            "朝鲜":[125.30,39.09],
            "刚果(扎伊尔)":[15.15,-4.20],
            "丹麦":[12.34,55.41],
            "吉布提":[42.20,11.08],
            "多米尼加":[-61.24,15.20],
            "多米尼加共和国":[-69.59,18.30],
            "东帝汶":[125.34,-8.29],
            "厄瓜多尔":[-78.35,-0.15],
            "埃及":[31.14,30.01],
            "萨尔瓦多":[-89.10,13.40],
            "赤道几内亚":[8.50,3.45],
            "厄立特里亚":[38.55,15.19],
            "爱沙尼亚":[24.48,59.22],
            "埃塞俄比亚":[38.42,9.02],
            "福克兰群岛(马尔维纳斯群岛)":[-59.51,-51.40],
            "法罗群岛":[-6.56,62.05],
            "斐济":[178.30,-18.06],
            "芬兰":[25.03,60.15],
            "法国":[2.20,48.50],
            "法属圭亚那":[-52.18,5.05],
            "法属波利尼西亚":[-149.34,-17.32],
            "加蓬":[9.26,0.25],
            "冈比亚":[-16.40,13.28],
            "格鲁吉亚":[44.50,41.43],
            "德国":[13.25,52.30],
            "加纳":[-0.06,5.35],
            "希腊":[23.46,37.58],
            "格陵兰":[-51.35,64.10],
            "瓜德罗普岛":[-61.44,16.00],
            "危地马拉":[-90.22,14.40],
            "根西岛":[-2.33,49.26],
            "几内亚":[-13.49,9.29],
            "几内亚比绍":[-15.45,11.45],
            "圭亚那":[-58.12,6.50],
            "海地":[-72.20,18.40],
            "赫德岛和麦当劳群岛":[74.00,-53.00],
            "洪都拉斯":[-87.14,14.05],
            "匈牙利":[19.05,47.29],
            "冰岛":[-21.57,64.10],
            "印度":[77.13,28.37],
            "印度尼西亚":[106.49,-6.09],
            "伊朗":[51.30,35.44],
            "伊拉克":[44.30,33.20],
            "爱尔兰":[-6.15,53.21],
            "以色列":[35.12,31.47],
            "意大利":[12.29,41.54],
            "牙买加":[-76.50,18.00],
            "约旦":[35.52,31.57],
            "哈萨克斯坦":[71.30,51.10],
            "肯尼亚":[36.48,-1.17],
            "基里巴斯":[173.00,1.30],
            "科威特":[48.00,29.30],
            "吉尔吉斯斯坦":[74.46,42.54],
            "老挝":[102.36,17.58],
            "拉脱维亚":[24.08,56.53],
            "黎巴嫩":[35.31,33.53],
            "莱索托":[27.30,-29.18],
            "利比里亚":[-10.47,6.18],
            "阿拉伯利比亚民众国":[13.07,32.49],
            "列支敦士登":[9.31,47.08],
            "立陶宛":[25.19,54.38],
            "卢森堡":[6.09,49.37],
            "马达加斯加":[47.31,-18.55],
            "马拉维":[33.48,-14.00],
            "马来西亚":[101.41,3.09],
            "马尔代夫":[73.28,4.00],
            "马里":[-7.55,12.34],
            "马耳他":[14.31,35.54],
            "马提尼克岛":[-61.02,14.36],
            "毛里塔尼亚":[57.30,-20.10],
            "马约特岛":[45.14,-12.48],
            "墨西哥":[-99.10,19.20],
            "密克罗尼西亚(联邦)":[158.09,6.55],
            "摩尔多瓦共和国":[28.50,47.02],
            "莫桑比克":[32.32,-25.58],
            "缅甸":[96.20,16.45],
            "纳米比亚":[17.04,-22.35],
            "尼泊尔":[85.20,27.45],
            "荷兰":[4.54,52.23],
            "荷属安的列斯":[-69.00,12.05],
            "新喀里多尼亚":[166.30,-22.17],
            "新西兰":[174.46,-41.19],
            "尼加拉瓜":[-86.20,12.06],
            "尼日尔":[2.06,13.27],
            "尼日利亚":[7.32,9.05],
            "诺福克岛":[168.43,-45.20],
            "北马里亚纳群岛":[145.45,15.12],
            "挪威":[10.45,59.55],
            "阿曼":[58.36,23.37],
            "巴基斯坦":[73.10,33.40],
            "帕劳":[134.28,7.20],
            "巴拿马":[-79.25,9.00],
            "巴布亚新几内亚":[147.08,-9.24],
            "巴拉圭":[-57.30,-25.10],
            "秘鲁":[-77.00,-12.00],
            "菲律宾":[121.03,14.40],
            "波兰":[21.00,52.13],
            "葡萄牙":[-9.10,38.42],
            "波多黎各":[-66.07,18.28],
            "卡塔尔":[51.35,25.15],
            "韩国":[126.58,37.31],
            "罗马尼亚":[26.10,44.27],
            "俄罗斯":[37.35,55.45],
            "卢旺达":[30.04,-1.59],
            "圣基茨和尼维斯":[-62.43,17.17],
            "圣卢西亚":[-60.58,14.02],
            "圣皮埃尔和密克隆":[-56.12,46.46],
            "圣文森特和格林纳丁斯":[-61.10,13.10],
            "萨摩亚":[-171.50,-13.50],
            "圣马力诺":[12.30,43.55],
            "圣多美和普林西比":[6.39,0.10],
            "沙特阿拉伯":[46.42,24.41],
            "塞内加尔":[-17.29,14.34],
            "塞拉利昂":[-13.17,8.30],
            "斯洛伐克":[17.07,48.10],
            "斯洛文尼亚":[14.33,46.04],
            "所罗门群岛":[159.57,-9.27],
            "索马里":[45.25,2.02],
            "比勒陀利亚":[28.12,-25.44],
            "西班牙":[-3.45,40.25],
            "苏丹":[32.35,15.31],
            "苏里南":[-55.10,5.50],
            "斯威士兰":[31.06,-26.18],
            "瑞典":[18.03,59.20],
            "瑞士":[7.28,46.57],
            "阿拉伯叙利亚共和国":[36.18,33.30],
            "塔吉克斯坦":[68.48,38.33],
            "泰国":[100.35,13.45],
            "马其顿":[21.26,42.01],
            "多哥":[1.20,6.09],
            "汤加":[-174.00,-21.10],
            "突尼斯":[10.11,36.50],
            "土耳其":[32.54,39.57],
            "土库曼斯坦":[57.50,38.00],
            "图瓦卢":[179.13,-8.31],
            "乌干达":[32.30,0.20],
            "乌克兰":[30.28,50.30],
            "阿联酋":[54.22,24.28],
            "英国":[-0.05,51.36],
            "坦桑尼亚":[35.45,-6.08],
            "美国":[-77.02,39.91],
            "美属维尔京群岛":[-64.56,18.21],
            "乌拉圭":[-56.11,-34.50],
            "乌兹别克斯坦":[69.10,41.20],
            "瓦努阿图":[168.18,-17.45],
            "委内瑞拉":[-66.55,10.30],
            "越南":[105.55,21.05],
            "南斯拉夫":[20.37,44.50],
            "赞比亚":[28.16,-15.28],
            "津巴布韦":[31.02,-17.43],
        };
        //地名转换函数
        var funcConvertData = function(poData)
        {
            var oMerge = [];
            for (var nLoop = 0; nLoop < poData.length; nLoop++)
            {
                var poGeoCoord = mapGeoCoordMap[poData[nLoop].name];
                if (poGeoCoord)
                {
                    oMerge.push
                    ({
                        name: poData[nLoop].name,
                        value: poGeoCoord.concat(poData[nLoop].value)
                    });
                }
            }
            return oMerge;
        };
        function SetSymbolSize(poNode)
        {
            if (poNode[2] < 10)
                return 3;
            if (poNode[2] < 30)
                return poNode[2] / 3;
            return 10;
        };
        //设置数据
        g_oChart.setOption
        ({
            series:[
                {
                    type	:	'scatter',
                    coordinateSystem:	'geo',
                    data	:	funcConvertData(oData),
                    symbolSize:	SetSymbolSize,
                    itemStyle:
                        {
                            normal: {color: '#ddb926'}
                        },
                    label:
                        {
                            emphasis:
                                {
                                    formatter:'{b}',
                                    position:'right',
                                    show:true,
                                    textStyle:
                                        {
                                            color:'#1589FF',
                                            fontWeight:'bold'
                                        }
                                }
                        }
                },{
                    type	:	'effectScatter',
                    coordinateSystem:'geo',
                    data	:	funcConvertData(oData.sort(function (a, b) {return b.value - a.value;}).slice(0, 6)),
                    symbolSize:	SetSymbolSize,
                    showEffectOn:'render',
                    rippleEffect:
                        {
                            scale	:	2,
                            brushType:	'stroke'
                        },
                    label:
                        {
                            normal:
                                {
                                    formatter: '{b}',
                                    position: 'right',
                                    show: true
                                }
                        },
                    itemStyle:
                        {
                            normal	:	{color: '#f4e925'}
                        },
                    zlevel: 1
                }]
        });
    };

    function AnsyRefresh(type)
    {
        SetFullMask('地区数据更新中，请稍候');
        $.ajax
        ({
            url		:	'./getData.php?type='+type,
            async	:	true,
            cache	:	false,
            type	:	'GET',
            success	:	function(oRsp)
            {
                var oRspJson;
                try
                {
                    oRspJson = JSON.parse(oRsp);
                }
                catch (eErr)
                {
                    oRspJson = {success:false,error:'后台返回数据解析失败'};
                }
                if (oRspJson.success == false)
                    console.log(oRspJson.error);
                else
                {
                    //转换数据
                    var oMapData = [];
                    for (var strKey in oRspJson.data)
                        oMapData.push({name:strKey,value:oRspJson.data[strKey]});
                    ShowChart($('#main')[0],oMapData);
                }
//                if(type == 1){
//                    setTimeout(AnsyRefresh(type),5000);
//                }
                HideFullMask();
            },
            error: function(oRsp)
            {
                HideFullMask();
                console.log(oRsp.status + ':' + oRsp.statusText);
//                setTimeout(AnsyRefresh(type),5000);
            }
        });
    }

    function refresh(){
        AnsyRefresh($('#selectType').val());
    }
    AnsyRefresh(0);
</script>
</body>
</html>
